###[ Series / DataFrame 다루기]
- Series/DataFrame의 속성 읽기/변경
- Series/DataFrame 행인덱스/열이름 전체/부분변경 : rename(index, columns, inplace)
- Series/DataFrame 행/열 축 이름 설정 : rename_axis(index,columns, inplace)
- Series/DataFrame 행/열 삭제 : drop(labels, axis, index, columns, inplace)
- 기억 매개변수
    * axis : 행과 열 방향 설정 매개변수
        - 0 -> 행 기준 [기본]
        - 1-> 열 기준
    * inplace : 원본 데이터 유지 여부 설정
        - False -> 원본유지, 복사본 반환[기본]
        - True  -> 원본으로 작업 진행, None반환

In [1]:
## 모듈 로딩
import pandas as pd

In [2]:
## 데이터 준비
dataDF = pd.read_json('../Data/test.json')

display(dataDF)

   id  value1  value2
0   1      20    3.40
1   2      12    2.10
2   3      11    9.70
3   4       9    0.12
4   5      31    9.99

[실습문제]
<hr>

In [5]:
## [1] 행인덱스를 변경
## [0,1,2,3,4] ====> ['하나', '둘', '셋', '넷', '다섯']
dataDF.index = ['하나','둘','셋','넷','다섯']

display(dataDF)

    id  value1  value2
하나   1      20    3.40
둘    2      12    2.10
셋    3      11    9.70
넷    4       9    0.12
다섯   5      31    9.99

In [ ]:
## [2] 컬럼 변경
## 'id', 'value1', 'value2' ====> 'id', 'v1', 'v2'
dataDF.columns = ['id','v1','v2']

display(dataDF)

    id  v1    v2
하나   1  20  3.40
둘    2  12  2.10
셋    3  11  9.70
넷    4   9  0.12
다섯   5  31  9.99

In [18]:
## [3] 행 둘 넷 삭제/ 단, 원본 손실 x
dataDF1 = dataDF.drop(index=['둘','넷'])

display(dataDF1)

    id  v1    v2
하나   1  20  3.40
셋    3  11  9.70
다섯   5  31  9.99

In [ ]:
## [4] 아래와 같은 결과가 나오도록 코드 작성하세요.

# id	value1	value2
# 0	1	20	3.40
# 1	2	12	2.10
# 2	3	11	9.70
# 3	4	9	0.12
# 4	5	31	9.99


#  ID	DATA
# A	1	3.40
# B	3	9.70
# C	5	9.99

In [19]:
dataDF1.drop(columns=['v1'], inplace=True)

dataDF1.columns=['ID', 'DATA']
dataDF1.index = ['A','B','C']

display(dataDF1)

   ID  DATA
A   1  3.40
B   3  9.70
C   5  9.99